ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_NUC472/TARGET_NUMAKER_PFM_NUC472/PeripheralPins.c
    // GPIO H MFPL
    {PH_0, GPIO_H, SYS_GPH_MFPL_PH0MFP_GPIO},
    {PH_1, GPIO_H, SYS_GPH_MFPL_PH1MFP_GPIO},
    {PH_2, GPIO_H, SYS_GPH_MFPL_PH2MFP_GPIO},
    {PH_3, GPIO_H, SYS_GPH_MFPL_PH3MFP_GPIO},
    {PH_4, GPIO_H, SYS_GPH_MFPL_PH4MFP_GPIO},
    {PH_5, GPIO_H, SYS_GPH_MFPL_PH5MFP_GPIO},
    {PH_6, GPIO_H, SYS_GPH_MFPL_PH6MFP_GPIO},
    {PH_7, GPIO_H, SYS_GPH_MFPL_PH7MFP_GPIO},
    // GPIO H MFPH
    {PH_8, GPIO_H, SYS_GPH_MFPH_PH8MFP_GPIO},
    {PH_9, GPIO_H, SYS_GPH_MFPH_PH9MFP_GPIO},
    {PH_10, GPIO_H, SYS_GPH_MFPH_PH10MFP_GPIO},
    {PH_11, GPIO_H, SYS_GPH_MFPH_PH11MFP_GPIO},
    {PH_12, GPIO_H, SYS_GPH_MFPH_PH12MFP_GPIO},
    {PH_13, GPIO_H, SYS_GPH_MFPH_PH13MFP_GPIO},
    {PH_14, GPIO_H, SYS_GPH_MFPH_PH14MFP_GPIO},
    {PH_15, GPIO_H, SYS_GPH_MFPH_PH15MFP_GPIO},
    
    // GPIO I MFPL
    {PI_0, GPIO_I, SYS_GPI_MFPL_PI0MFP_GPIO},
    {PI_1, GPIO_I, SYS_GPI_MFPL_PI1MFP_GPIO},
    {PI_2, GPIO_I, SYS_GPI_MFPL_PI2MFP_GPIO},
    {PI_3, GPIO_I, SYS_GPI_MFPL_PI3MFP_GPIO},
    {PI_4, GPIO_I, SYS_GPI_MFPL_PI4MFP_GPIO},
    {PI_5, GPIO_I, SYS_GPI_MFPL_PI5MFP_GPIO},
    {PI_6, GPIO_I, SYS_GPI_MFPL_PI6MFP_GPIO},
    {PI_7, GPIO_I, SYS_GPI_MFPL_PI7MFP_GPIO},
    // GPIO I MFPI
    {PI_8, GPIO_I, SYS_GPI_MFPH_PI8MFP_GPIO},
    {PI_9, GPIO_I, SYS_GPI_MFPH_PI9MFP_GPIO},
    {PI_10, GPIO_I, SYS_GPI_MFPH_PI10MFP_GPIO},
    {PI_11, GPIO_I, SYS_GPI_MFPH_PI11MFP_GPIO},
    {PI_12, GPIO_I, SYS_GPI_MFPH_PI12MFP_GPIO},
    {PI_13, GPIO_I, SYS_GPI_MFPH_PI13MFP_GPIO},
    {PI_14, GPIO_I, SYS_GPI_MFPH_PI14MFP_GPIO},
    {PI_15, GPIO_I, SYS_GPI_MFPH_PI15MFP_GPIO},
};
#endif

//*** ADC ***

const PinMap PinMap_ADC[] = {
    {PE_0, ADC_0_0, SYS_GPE_MFPL_PE0MFP_ADC0_0},  // ADC0_0
    {PE_1, ADC_0_1, SYS_GPE_MFPL_PE1MFP_ADC0_1},  // ADC0_1
    {PE_2, ADC_0_2, SYS_GPE_MFPL_PE2MFP_ADC0_2},  // ADC0_2
    {PE_3, ADC_0_3, SYS_GPE_MFPL_PE3MFP_ADC0_3},  // ADC0_3
    {PE_4, ADC_0_4, SYS_GPE_MFPL_PE4MFP_ADC0_4},  // ADC0_4
    {PE_5, ADC_0_5, SYS_GPE_MFPL_PE5MFP_ADC0_5},  // ADC0_5
    {PE_6, ADC_0_6, SYS_GPE_MFPL_PE6MFP_ADC0_6},  // ADC0_6
    {PE_7, ADC_0_7, SYS_GPE_MFPL_PE7MFP_ADC0_7},  // ADC0_7

    {PE_8, ADC_0_8, SYS_GPE_MFPH_PE8MFP_ADC1_0},  // ADC0_8/ADC1_0
    {PE_9, ADC_0_9, SYS_GPE_MFPH_PE9MFP_ADC1_1},  // ADC0_9/ADC1_1
    {PE_10, ADC_0_10, SYS_GPE_MFPH_PE10MFP_ADC1_2},  // ADC0_10/ADC1_2
    {PE_11, ADC_0_11, SYS_GPE_MFPH_PE11MFP_ADC1_3},  // ADC0_11/ADC1_3
    
    {NC,   NC,    0}
};

//*** I2C ***

const PinMap PinMap_I2C_SDA[] = {
    {PB_1,  I2C_4, SYS_GPB_MFPL_PB1MFP_I2C4_SDA},
    {PB_7,  I2C_2, SYS_GPB_MFPL_PB7MFP_I2C2_SDA},
    {PC_9, I2C_0, SYS_GPC_MFPH_PC9MFP_I2C0_SDA},
    {PD_3,  I2C_3, SYS_GPD_MFPL_PD3MFP_I2C3_SDA},
    {PD_9,  I2C_0, SYS_GPD_MFPH_PD9MFP_I2C0_SDA},
    {PD_12, I2C_4, SYS_GPD_MFPH_PD12MFP_I2C4_SDA},
    {PG_14, I2C_1, SYS_GPG_MFPH_PG14MFP_I2C1_SDA},
    {PH_1, I2C_1, SYS_GPH_MFPL_PH1MFP_I2C1_SDA},
    {PH_4, I2C_3, SYS_GPH_MFPL_PH4MFP_I2C3_SDA},
    {PI_8, I2C_2, SYS_GPI_MFPH_PI8MFP_I2C2_SDA},
    
    {NC,    NC,    0}
};

const PinMap PinMap_I2C_SCL[] = {
    {PA_15, I2C_0, SYS_GPA_MFPH_PA15MFP_I2C0_SCL},
    {PB_0, I2C_4, SYS_GPB_MFPL_PB0MFP_I2C4_SCL},
    {PB_6, I2C_2, SYS_GPB_MFPL_PB6MFP_I2C2_SCL},
    {PC_9, I2C_3, SYS_GPC_MFPH_PC9MFP_I2C3_SCL},
    {PD_2, I2C_3, SYS_GPD_MFPL_PD2MFP_I2C3_SCL},
    {PD_8, I2C_0, SYS_GPD_MFPH_PD8MFP_I2C0_SCL},
    {PD_10, I2C_4, SYS_GPD_MFPH_PD10MFP_I2C4_SCL},
    {PG_15, I2C_1, SYS_GPG_MFPH_PG15MFP_I2C1_SCL},
    {PH_0, I2C_1, SYS_GPH_MFPL_PH0MFP_I2C1_SCL},
    {PH_3, I2C_3, SYS_GPH_MFPL_PH3MFP_I2C3_SCL},
    {PI_7, I2C_2, SYS_GPI_MFPL_PI7MFP_I2C2_SCL},
    
    {NC,    NC,    0}
};

//*** PWM ***

const PinMap PinMap_PWM[] = {
    {PA_5, PWM_0_0, SYS_GPA_MFPL_PA5MFP_PWM0_CH0},
    {PA_6, PWM_0_1, SYS_GPA_MFPL_PA6MFP_PWM0_CH1},
    {PA_7, PWM_1_3, SYS_GPA_MFPL_PA7MFP_PWM1_CH3},
    //{PA_7, EPWM_0, SYS_GPA_MFPL_PA7MFP_EPWM0_CH5},
    //{PA_7, EPWM_0, SYS_GPA_MFPL_PA7MFP_EPWM0_CH5},
    {PA_8, PWM_1_2, SYS_GPA_MFPH_PA8MFP_PWM1_CH2},
    //{PA_8, EPWM_0, SYS_GPA_MFPH_PA8MFP_EPWM0_CH4},
    {PA_9, PWM_1_1, SYS_GPA_MFPH_PA9MFP_PWM1_CH1},
    //{PA_9, EPWM_0, SYS_GPA_MFPH_PA9MFP_EPWM0_CH3},
    {PA_10, PWM_1_0, SYS_GPA_MFPH_PA10MFP_PWM1_CH0},
    //{PA_10, EPWM_0, SYS_GPA_MFPH_PA10MFP_EPWM0_CH2},
    {PA_11, PWM_0_5, SYS_GPA_MFPH_PA11MFP_PWM0_CH5},
    //{PA_11, EPWM_0, SYS_GPA_MFPH_PA11MFP_EPWM0_CH1},
    {PA_12, PWM_0_4, SYS_GPA_MFPH_PA12MFP_PWM0_CH4},
    //{PA_12, EPWM_0, SYS_GPA_MFPH_PA12MFP_EPWM0_CH0},
    {PA_13, PWM_1_4, SYS_GPA_MFPH_PA13MFP_PWM1_CH4},
    {PA_14, PWM_1_5, SYS_GPA_MFPH_PA14MFP_PWM1_CH5},
    {PB_6, PWM_1_4, SYS_GPB_MFPL_PB6MFP_PWM1_CH4},
    //{PB_6, EPWM_1, SYS_GPB_MFPL_PB6MFP_EPWM1_CH0},
    {PB_7, PWM_1_5, SYS_GPB_MFPL_PB7MFP_PWM1_CH5},
    //{PB_7, EPWM_1, SYS_GPB_MFPL_PB7MFP_EPWM1_CH1},
    //{PB_8, EPWM_1, SYS_GPB_MFPH_PB8MFP_EPWM1_CH2},
    //{PB_9, EPWM_1, SYS_GPB_MFPH_PB9MFP_EPWM1_CH3},
    //{PB_10, EPWM_1, SYS_GPB_MFPH_PB10MFP_EPWM1_CH4},
    //{PB_11, EPWM_1, SYS_GPB_MFPH_PB11MFP_EPWM1_CH5},
    {PC_10, PWM_0_2, SYS_GPC_MFPH_PC10MFP_PWM0_CH2},
    {PC_11, PWM_0_3, SYS_GPC_MFPH_PC11MFP_PWM0_CH3},
    {PF_9, PWM_0_0, SYS_GPF_MFPH_PF9MFP_PWM0_CH0},
    {PF_10, PWM_0_1, SYS_GPF_MFPH_PF10MFP_PWM0_CH1},

    {NC,    NC,    0}
};

//*** SERIAL ***

const PinMap PinMap_UART_TX[] = {
    {PA_14, UART_0, SYS_GPA_MFPH_PA14MFP_UART0_TXD},
    {PB_3, UART_1, SYS_GPB_MFPL_PB3MFP_UART1_TXD},
    {PB_5, UART_4, SYS_GPB_MFPL_PB5MFP_UART4_TXD},
    {PB_10, UART_5, SYS_GPB_MFPH_PB10MFP_UART5_TXD},
    {PC_1, UART_4, SYS_GPC_MFPL_PC1MFP_UART4_TXD},
    {PC_11, UART_2, SYS_GPC_MFPH_PC11MFP_UART2_TXD},
    {PD_5, UART_3, SYS_GPD_MFPL_PD5MFP_UART3_TXD},
    {PD_15, UART_5, SYS_GPD_MFPH_PD15MFP_UART5_TXD},
    {PF_7, UART_2, SYS_GPF_MFPL_PF7MFP_UART2_TXD},
    {PF_13, UART_1, SYS_GPF_MFPH_PF13MFP_UART1_TXD},
    {PG_2, UART_0, SYS_GPG_MFPL_PG2MFP_UART0_TXD},
    {PH_1, UART_4, SYS_GPH_MFPL_PH1MFP_UART4_TXD},
    {PH_12, UART_3, SYS_GPH_MFPH_PH12MFP_UART3_TXD},
    
    {NC,    NC,     0}
};

const PinMap PinMap_UART_RX[] = {
    {PA_13, UART_0, SYS_GPA_MFPH_PA13MFP_UART0_RXD},
    {PB_2, UART_1, SYS_GPB_MFPL_PB2MFP_UART1_RXD},
    {PB_4, UART_4, SYS_GPB_MFPL_PB4MFP_UART4_RXD},
    {PB_11, UART_5, SYS_GPB_MFPH_PB11MFP_UART5_RXD},
    {PC_0, UART_4, SYS_GPC_MFPL_PC0MFP_UART4_RXD},
    {PC_10, UART_2, SYS_GPC_MFPH_PC10MFP_UART2_RXD},
    {PD_4, UART_3, SYS_GPD_MFPL_PD4MFP_UART3_RXD},
    {PF_0, UART_5, SYS_GPF_MFPL_PF0MFP_UART5_RXD},
    {PF_6, UART_2, SYS_GPF_MFPL_PF6MFP_UART2_RXD},
    {PF_14, UART_1, SYS_GPF_MFPH_PF14MFP_UART1_RXD},
    {PG_1, UART_0, SYS_GPG_MFPL_PG1MFP_UART0_RXD},
    {PH_0, UART_4, SYS_GPH_MFPL_PH0MFP_UART4_RXD},
    {PH_11, UART_3, SYS_GPH_MFPH_PH11MFP_UART3_RXD},
    
    {NC,    NC,     0}
};

